{
  "messages": [],
  "metadata": {
    "deck_id": "FEN_BCR",
    "title": "Basic Core",
    "template": "FEN_TEMPLATE",
    "theme_config": {},
    "created_at": "2025-02-01T16:29:25.500979",
    "version": "1.0"
  },
  "deck_info": {
    "path": "decks/FEN_BCR",
    "metadata": {
      "deck_id": "FEN_BCR",
      "title": "Basic Core",
      "template": "FEN_TEMPLATE",
      "theme_config": {},
      "created_at": "2025-02-01T16:29:25.500979",
      "version": "1.0"
    }
  },
  "slides": [],
  "pdf_path": "decks/FEN_BCR/img/pdfs/BasicCore_brochure2.pdf",
  "pdf_info": {
    "num_pages": 5,
    "page_paths": [
      "decks/FEN_BCR/img/pages/page_1.png",
      "decks/FEN_BCR/img/pages/page_2.png",
      "decks/FEN_BCR/img/pages/page_3.png",
      "decks/FEN_BCR/img/pages/page_4.png",
      "decks/FEN_BCR/img/pages/page_5.png"
    ],
    "output_dir": "decks/FEN_BCR/img/pages"
  },
  "awaiting_input": null,
  "page_summaries": null,
  "processed_summaries": "```markdown\n# Basic Core Insurance Benefits Presentation\n\n## Introduction/Overview\nThe Basic Core and Basic Core-Plus insurance plans, underwritten by American Public Life Insurance Company, offer comprehensive managed care solutions. These plans are designed to provide immediate coverage with no waiting periods or exclusions for pre-existing conditions. The offerings include a range of benefits that cater to diverse needs, from hospital admissions to virtual healthcare services.\n\n## Benefits and Features\n\n### Hospital and Medical Services\n- **Hospital Admission**: Covered at $500 per day for the first day, with additional daily confinement at $100 per day for up to ten days.\n- **Emergency Services**: Coverage includes emergency room, urgent care, and physician office visits at $50 per day within specified limits.\n- **Medical Bill Repricer**: Utilizes Reference Based Pricing to manage medical costs by paying providers 150% to 200% of Medicare Allowable Rates. This service aids in provider selection, appointment setup, and helps negotiate or eliminate remaining balances after insurance payments.\n\n### Pharmacy and Telemedicine Benefits\n- **Pharmacy Plan**: Offers free acute and chronic medications, diabetic supplies, and pharmacy coaching. Members have access to a member portal and can enjoy cost savings on diabetic insulin and over-the-counter medications.\n- **Telemedicine Services**: Provides unlimited virtual doctor visits with no-cost consultations available 24/7. Prescriptions can be filled using the Free Prescription Club ID Card, ensuring significant savings on generic medications.\n\n### Additional Services\n- **Concierge and Advocacy Services**: Assist members in understanding benefits, filing claims, and financial negotiations.\n- **Entertainment and Lifestyle Discounts**: Includes savings on mail-order pharmacy, entertainment packages, direct lab testing, and business training. Discounts are also available on MRI and CT scans, diabetic and medical supplies, online health management services, online fitness programs, and alternative wellness services.\n\n## Plan Details\n\n### Basic Core vs. Basic Core-Plus\n- **Basic Core Plan**: Includes a free prescription club and virtual doctor visits at no cost.\n- **Basic Core-Plus Plan**: Offers free generic medications and unlimited telemedicine visits. The pricing for this plan is consistently higher than the Basic Core across all member classifications.\n\n## Costs and Coverage\n\n### Membership Pricing\nThe Business Workers of America's membership benefit package is competitively priced under the Basic Core and Basic Core-Plus plans:\n- **Pricing Categories**: Individual members, member and spouse, member and children, and family.\n- **Comparison**: The Basic Core-Plus Plan is consistently more expensive than the Basic Core Plan across all classifications, reflecting the additional benefits provided.\n\n## Conclusion\nThe Basic Core and Basic Core-Plus plans provide a robust array of benefits designed to meet the diverse needs of members, offering significant cost-saving opportunities and comprehensive coverage with immediate effect. The inclusion of innovative services such as Medical Bill Repricer and Telemedicine ensures members receive high-quality care and support.\n\n```\n\nThis structured format organizes the raw summaries into distinct sections, providing a coherent narrative suitable for both slide and audio script presentation.",
  "audio_config": {
    "title": "Basic Core",
    "script_path": "audio/audio_script.md",
    "slide_count": 0
  },
  "error_context": null
}