{
  "messages": [],
  "metadata": {
    "deck_id": "FEN_BCR",
    "title": "Basic Core",
    "template": "FEN_TEMPLATE",
    "theme_config": {},
    "created_at": "2025-02-01T21:27:57.139774",
    "version": "1.0"
  },
  "deck_info": {
    "path": "decks/FEN_BCR",
    "metadata": {
      "deck_id": "FEN_BCR",
      "title": "Basic Core",
      "template": "FEN_TEMPLATE",
      "theme_config": {},
      "created_at": "2025-02-01T21:27:57.139774",
      "version": "1.0"
    }
  },
  "slides": [],
  "pdf_path": "decks/FEN_BCR/img/pdfs/BasicCore_brochure2.pdf",
  "pdf_info": {
    "num_pages": 5,
    "page_paths": [
      "decks/FEN_BCR/img/pages/page_1.png",
      "decks/FEN_BCR/img/pages/page_2.png",
      "decks/FEN_BCR/img/pages/page_3.png",
      "decks/FEN_BCR/img/pages/page_4.png",
      "decks/FEN_BCR/img/pages/page_5.png"
    ],
    "output_dir": "decks/FEN_BCR/img/pages"
  },
  "awaiting_input": null,
  "page_summaries": null,
  "processed_summaries": "# Title Page\n**Title:** Basic Core Insurance Benefits  \n**Subtitle:** Comprehensive Overview and Plan Details  \n\n# Introduction/Overview\nThis presentation provides an in-depth exploration of the Basic Core Insurance plans, which include the Basic Core Indemnity Insurance and the Basic Core-Plus Managed Care. It is designed to offer clarity on the benefits, features, and pricing associated with these plans, emphasizing the absence of waiting or exclusion periods for pre-existing conditions, while noting the exclusion of pregnancy coverage. \n\n# Benefits and Features\n- **Hospital and Medical Services:**\n  - Benefits include coverage for hospital admission, daily confinement, emergency room, urgent care, and physician office visits.\n  - Members have access to a Medical Bill Repricer system, which leverages Reference Based Pricing to manage costs effectively.\n  - The advocacy concierge service supports members in understanding benefits, locating providers, and negotiating costs to minimize out-of-pocket expenses.\n\n- **Pharmacy and Telemedicine:**\n  - Access to a free prescription club with discounts on medications and diabetic supplies.\n  - Unlimited, no-cost telemedicine services for Basic Core-Plus members, enabling 24/7 virtual doctor consultations.\n\n# Plan Tiers\n- **Basic Core Plan:**\n  - Covers hospital and emergency services with set payment amounts and day limits.\n  - Includes a $25 prepay for primary care visits and a $50 prepay for specialist visits.\n  - Members can choose any doctor or specialist without network restrictions.\n\n- **Basic Core-Plus Plan:**\n  - Offers all Basic Core benefits, plus additional features such as no-cost virtual doctor visits and a broader prescription discount program.\n  - Provides enhanced access to telemedicine and pharmacy benefits, including mail-order services with up to 80% savings.\n\n# Comparing Plans\n- **Basic Core vs. Basic Core-Plus:**\n  - Basic Core focuses on essential medical services with a straightforward benefit structure.\n  - Basic Core-Plus enhances the offering with telemedicine, prescription club discounts, and additional member services like entertainment and wellness discounts.\n\n# Limitations and Exclusions\n- **Exclusions:**\n  - Pregnancy coverage is not included in either plan.\n  - Specific exclusions related to plan benefits and services are detailed in the member package documentation.\n\n# Key Takeaways\n- The Basic Core and Basic Core-Plus plans provide comprehensive healthcare coverage with a focus on affordability and access.\n- By utilizing services such as the Medical Bill Repricer and advocacy concierge, members can manage healthcare costs effectively.\n- The additional benefits of the Basic Core-Plus plan, including virtual doctor visits and prescription discounts, offer enhanced value to members.\n\n# Pricing Details\n- **Membership Pricing:**\n  - Basic Core Plan: $32.78 for individual members, scaling up to $58.18 for family.\n  - Basic Core-Plus Plan: $45.22 for individual members, increasing to $70.62 for family.\n  - Pricing varies based on the member classification, reflecting the added benefits of each plan tier.\n\n# Thank You Slide\n**Thank You for Your Attention**  \n_FirstEnroll Logo_",
  "audio_config": {
    "title": "Basic Core",
    "script_path": "audio/audio_script.md",
    "slide_count": 0
  },
  "error_context": null
}