{
  "messages": [],
  "metadata": {
    "deck_id": "FEN_ADP",
    "title": "Ameritas Dental Plan",
    "template": "FEN_TEMPLATE",
    "theme_config": {},
    "created_at": "2025-02-01T13:50:41.316671",
    "version": "1.0"
  },
  "deck_info": {
    "path": "decks/FEN_ADP",
    "metadata": {
      "deck_id": "FEN_ADP",
      "title": "Ameritas Dental Plan",
      "template": "FEN_TEMPLATE",
      "theme_config": {},
      "created_at": "2025-02-01T13:50:41.316671",
      "version": "1.0"
    }
  },
  "slides": [],
  "pdf_path": "decks/FEN_ADP/img/pdfs/NCE_Ameritas_SchedulePlan_Brochure.pdf",
  "pdf_info": {
    "num_pages": 3,
    "page_paths": [
      "decks/FEN_ADP/img/pages/page_1.png",
      "decks/FEN_ADP/img/pages/page_2.png",
      "decks/FEN_ADP/img/pages/page_3.png"
    ],
    "output_dir": "decks/FEN_ADP/img/pages"
  },
  "awaiting_input": null,
  "page_summaries": null,
  "processed_summaries": "```markdown\n# Ameritas Dental and Vision Plan Overview\n\n## Introduction\nWelcome to the presentation on the Ameritas Dental and Vision Plan, which provides comprehensive benefits designed to cater to your dental and vision care needs. In this presentation, we will cover the benefits, coverage details, member savings, and additional services you can enjoy as part of the plan.\n\n---\n\n## Benefits and Features\n\n### Dental Plan Benefits\nThe Ameritas Dental Plan under the FUSION plan design offers robust benefits. Members can utilize up to $1,000 for dental expenses, with an additional $100 allocated for eye care, provided the total does not exceed $1,000. The dental benefits are categorized into three types:\n\n- **Type 1: Preventive (100% coverage, no deductible)**\n  - Routine exams\n  - X-rays\n  - Cleanings\n  \n- **Type 2: Basic (100% coverage, $50 deductible per person)**\n  - Restorative services like amalgams and composites\n  \n- **Type 3: Major (100% coverage, $50 deductible per person)**\n  - Complex procedures such as surgical extractions and crowns\n  \nThe annual deductible for Types 2 and 3 is $50 per person with a $150 family maximum, and the benefit year maximum is $1,000 per person.\n\n### Vision Plan Benefits\nThe vision plan includes allowances and service frequencies for exams, lenses, frames, and various types of lenses, all subject to maximums. \n\n### Dental Rewards\nMembers can grow their annual maximum benefits by visiting dental providers and submitting claims, with potential rewards up to $1,000. There is also flexibility to choose any dentist, maximizing network savings.\n\n---\n\n## Costs and Coverage\n\n### Limitations and Exclusions\nWhile there are no waiting periods for coverage, certain conditions apply for late entrants. Specifically, some benefits will not be payable during the first 12 months unless specific conditions are met.\n\n### Deductibles and Maximums\n- **Type 1 Preventive:** $0 deductible\n- **Type 2 and Type 3:** $50 deductible per person per year, $150 family maximum\n- **Benefit Year Maximum:** $1,000 per person\n\n---\n\n## Additional Services\n\n### Member Savings\n- **Prescription Savings:** Discounts on medications at participating pharmacies with no additional fees.\n  \n- **Vision Savings:** Up to 35% off eyewear frames and lenses at Walmart Vision Centers, along with guarantees such as satisfaction assurance and defect protection.\n\n### Customer Service\nMembers have access to dedicated customer service support. Contact details include a phone number and specified service hours to assist with any inquiries.\n\n---\n\n## Conclusion\nThe Ameritas Dental and Vision Plan offers a comprehensive suite of benefits designed to meet your dental and vision care needs with flexibility and savings. Members are encouraged to take full advantage of these offerings to maximize their health benefits and potential rewards.\n```\n\nThis structured format organizes the content into logical sections, making it suitable for both slide presentation and audio script generation.",
  "audio_config": {
    "title": "Ameritas Dental Plan",
    "script_path": "audio/audio_script.md",
    "slide_count": 0
  },
  "error_context": null
}