{
  "messages": [],
  "metadata": {
    "deck_id": "FEN_BCR",
    "title": "Basic Core",
    "template": "FEN_TEMPLATE",
    "theme_config": {},
    "created_at": "2025-02-01T14:49:28.285970",
    "version": "1.0"
  },
  "deck_info": {
    "path": "decks/FEN_BCR",
    "metadata": {
      "deck_id": "FEN_BCR",
      "title": "Basic Core",
      "template": "FEN_TEMPLATE",
      "theme_config": {},
      "created_at": "2025-02-01T14:49:28.285970",
      "version": "1.0"
    }
  },
  "slides": [],
  "pdf_path": "decks/FEN_BCR/img/pdfs/BasicCore_brochure2.pdf",
  "pdf_info": {
    "num_pages": 5,
    "page_paths": [
      "decks/FEN_BCR/img/pages/page_1.png",
      "decks/FEN_BCR/img/pages/page_2.png",
      "decks/FEN_BCR/img/pages/page_3.png",
      "decks/FEN_BCR/img/pages/page_4.png",
      "decks/FEN_BCR/img/pages/page_5.png"
    ],
    "output_dir": "decks/FEN_BCR/img/pages"
  },
  "awaiting_input": null,
  "page_summaries": null,
  "processed_summaries": "# Basic Core Insurance Benefits Presentation\n\n## Introduction/Overview\n\n### Basic Core Insurance Benefits Overview\nThis section introduces the Basic Core insurance plans, highlighting a comparison between the Basic Core and Basic Core-Plus managed care options. The plans focus on offering comprehensive healthcare services including hospital admission, daily confinement, emergency room visits, urgent care, and physician office visits. The plans specify payment limits per day and maximum days covered to provide members with clarity on their coverage.\n\n## Benefits and Features\n\n### Medical Bill Repricer Overview\nThe Medical Bill Repricer is a significant feature within the Managed Care Benefit Package. This program utilizes Reference Based Pricing to effectively manage and reduce medical expenses by compensating healthcare providers a certain percentage of Medicare Allowable Rates. This cost-reduction strategy is well-received and aids members in minimizing their financial burden during doctor visits, where members pay a nominal pre-pay amount of $25 for primary care or $50 for specialists.\n\n### Pharmacy Plan and Telemedicine Benefits\nThe Pharmacy Plan, under the 'Free Prescription Club', offers free acute and chronic medications, diabetic supplies, and pharmacy coaching. Members have access to a portal for managing their accounts and can avail low-cost diabetic insulin and competitively priced over-the-counter medications. The Telemedicine services provide 24/7 access to virtual consultations and prescriptions, with the Basic Core Plus plan offering unlimited consultations at no cost.\n\n### Association Member Benefit Package Overview\nBoth the Basic Core and Basic Core Plus packages include vital services such as medical bill repricing, reference-based pricing, and advocacy/concierge service. The Basic Core Plus extends additional benefits like no-cost virtual doctor visits and access to a free prescription club. Members also benefit from direct lab testing, MRI and CT scans, diabetic supplies, and online health management tools.\n\n## Plan Details\n\n### Membership Benefit Package Pricing\nThe Membership Benefit Package is underwritten by American Public Life Insurance Company, boasting an A+ Superior AM Best Rating. Pricing is structured to cater to various member categories:\n\n- Individual Members\n- Member and Spouse\n- Member and Child(ren)\n- Family\n\nThe pricing is divided between the Basic Core Plan and the Basic Core-Plus Plan, with costs adjusted based on the membership type.\n\n## Costs and Coverage\n\n### Plan Specifics\nThere are no waiting or exclusion periods for pre-existing conditions in both plans. Pregnancy coverage is not included. The Basic Core plan provides essential services, while the Basic Core Plus plan enhances these with additional coverage like no-cost virtual doctor visits.\n\n## Additional Services\n\n### Additional Benefits\nBoth plans include additional services such as free prescription clubs and telemedicine, ensuring members have access to necessary medications and medical consultations at their convenience. The Concierge Service is available to assist members in understanding their benefits and managing any outstanding balances.\n\n## Limitations and Exclusions\n\n### Exclusions\nIt is important to note that neither the Basic Core nor the Basic Core Plus plans cover pregnancy. Members should review the specific details of each plan to fully understand the scope and limitations of their coverage.\n\nBy structuring the presentation in this manner, we ensure a logical flow that clearly communicates the key aspects of the Basic Core Insurance Benefits, catering to both a slide format and audio script generation.",
  "audio_config": {
    "title": "Basic Core",
    "script_path": "audio/audio_script.md",
    "slide_count": 0
  },
  "error_context": null
}